Roles/src/Catalogs/Roles_AccessRoles/Roles_AccessRoles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Roles_AccessRoles</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SetRightsForNewNativeObjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SetRightsForAttributesAndTabularSectionsByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SubordinateObjectsHaveIndependentRights</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ConfigRoles</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Configuration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastHashUpdate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SetSeparateRightToStandardAttributes</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>ObjectType</name>
      <type>
        <types>EnumRef.Roles_MetadataTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightName</name>
      <type>
        <types>EnumRef.Roles_Rights</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ObjectPath</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RightValue</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Disable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ObjectSubtype</name>
      <type>
        <types>EnumRef.Roles_MetadataSubtype</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RestrictionByCondition</name>
    <attributes>
      <name>RowID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Fields</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Condition</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>FilterDataStorage</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Templates</name>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Template</name>
      <type>
        <types>CatalogRef.Roles_Templates</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>LangInfo</name>
    <attributes>
      <name>LangCode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>LangDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Roles/src/Enums/Roles_MetadataTypes/Roles_MetadataTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_MetadataTypes</name>
  <enumValues>
    <name>AccountingRegister</name>
  </enumValues>
  <enumValues>
    <name>AccumulationRegister</name>
  </enumValues>
  <enumValues>
    <name>BusinessProcess</name>
  </enumValues>
  <enumValues>
    <name>CalculationRegister</name>
  </enumValues>
  <enumValues>
    <name>Catalog</name>
  </enumValues>
  <enumValues>
    <name>ChartOfAccounts</name>
  </enumValues>
  <enumValues>
    <name>ChartOfCalculationTypes</name>
  </enumValues>
  <enumValues>
    <name>ChartOfCharacteristicTypes</name>
  </enumValues>
  <enumValues>
    <name>CommonAttribute</name>
  </enumValues>
  <enumValues>
    <name>CommonCommand</name>
  </enumValues>
  <enumValues>
    <name>CommonForm</name>
  </enumValues>
  <enumValues>
    <name>Configuration</name>
  </enumValues>
  <enumValues>
    <name>Constant</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DocumentJournal</name>
  </enumValues>
  <enumValues>
    <name>Enum</name>
  </enumValues>
  <enumValues>
    <name>ExchangePlan</name>
  </enumValues>
  <enumValues>
    <name>ExternalDataSource</name>
  </enumValues>
  <enumValues>
    <name>FilterCriterion</name>
  </enumValues>
  <enumValues>
    <name>HTTPService</name>
  </enumValues>
  <enumValues>
    <name>InformationRegister</name>
  </enumValues>
  <enumValues>
    <name>IntegrationService</name>
  </enumValues>
  <enumValues>
    <name>Report</name>
  </enumValues>
  <enumValues>
    <name>Role</name>
  </enumValues>
  <enumValues>
    <name>Sequence</name>
  </enumValues>
  <enumValues>
    <name>SessionParameter</name>
  </enumValues>
  <enumValues>
    <name>Subsystem</name>
  </enumValues>
  <enumValues>
    <name>Task</name>
  </enumValues>
  <enumValues>
    <name>WebService</name>
  </enumValues>
  <enumValues>
    <name>Interface</name>
  </enumValues>
  <enumValues>
    <name>Language</name>
  </enumValues>
</mdclass:Enum>

Roles/src/Enums/Roles_MetadataSubtype/Roles_MetadataSubtype.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_MetadataSubtype</name>
  <enumValues>
    <name>Attribute</name>
  </enumValues>
  <enumValues>
    <name>Dimension</name>
  </enumValues>
  <enumValues>
    <name>Resource</name>
  </enumValues>
  <enumValues>
    <name>StandardAttribute</name>
  </enumValues>
  <enumValues>
    <name>Command</name>
  </enumValues>
  <enumValues>
    <name>Recalculation</name>
  </enumValues>
  <enumValues>
    <name>AccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>ExtDimensionAccountingFlag</name>
  </enumValues>
  <enumValues>
    <name>AddressingAttribute</name>
  </enumValues>
  <enumValues>
    <name>TabularSection</name>
  </enumValues>
  <enumValues>
    <name>StandardTabularSection</name>
  </enumValues>
  <enumValues>
    <name>Operation</name>
  </enumValues>
  <enumValues>
    <name>URLTemplate</name>
  </enumValues>
  <enumValues>
    <name>Method</name>
  </enumValues>
  <enumValues>
    <name>Cube</name>
  </enumValues>
  <enumValues>
    <name>Table</name>
  </enumValues>
  <enumValues>
    <name>DimensionTable</name>
  </enumValues>
  <enumValues>
    <name>Function</name>
  </enumValues>
  <enumValues>
    <name>Field</name>
  </enumValues>
</mdclass:Enum>

Roles/src/Enums/Roles_Rights/Roles_Rights.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Roles_Rights</name>
  <enumValues>
    <name>ActiveUsers</name>
  </enumValues>
  <enumValues>
    <name>Administration</name>
  </enumValues>
  <enumValues>
    <name>AnalyticsSystemClient</name>
  </enumValues>
  <enumValues>
    <name>Automation</name>
  </enumValues>
  <enumValues>
    <name>CollaborationSystemInfoBaseRegistration</name>
  </enumValues>
  <enumValues>
    <name>ConfigurationExtensionsAdministration</name>
  </enumValues>
  <enumValues>
    <name>DataAdministration</name>
  </enumValues>
  <enumValues>
    <name>Delete</name>
  </enumValues>
  <enumValues>
    <name>Edit</name>
  </enumValues>
  <enumValues>
    <name>EditDataHistoryVersionComment</name>
  </enumValues>
  <enumValues>
    <name>EventLog</name>
  </enumValues>
  <enumValues>
    <name>ExclusiveMode</name>
  </enumValues>
  <enumValues>
    <name>ExclusiveModeTerminationAtSessionStart</name>
  </enumValues>
  <enumValues>
    <name>Execute</name>
  </enumValues>
  <enumValues>
    <name>ExternalConnection</name>
  </enumValues>
  <enumValues>
    <name>Get</name>
  </enumValues>
  <enumValues>
    <name>InputByString</name>
  </enumValues>
  <enumValues>
    <name>Insert</name>
  </enumValues>
  <enumValues>
    <name>InteractiveActivate</name>
  </enumValues>
  <enumValues>
    <name>InteractiveChangeOfPosted</name>
  </enumValues>
  <enumValues>
    <name>InteractiveClearDeletionMark</name>
  </enumValues>
  <enumValues>
    <name>InteractiveClearDeletionMarkPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDelete</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeleteMarked</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeleteMarkedPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveDeletePredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveExecute</name>
  </enumValues>
  <enumValues>
    <name>InteractiveInsert</name>
  </enumValues>
  <enumValues>
    <name>InteractiveOpenExtDataProcessors</name>
  </enumValues>
  <enumValues>
    <name>InteractiveOpenExtReports</name>
  </enumValues>
  <enumValues>
    <name>InteractivePosting</name>
  </enumValues>
  <enumValues>
    <name>InteractivePostingRegular</name>
  </enumValues>
  <enumValues>
    <name>InteractiveSetDeletionMark</name>
  </enumValues>
  <enumValues>
    <name>InteractiveSetDeletionMarkPredefinedData</name>
  </enumValues>
  <enumValues>
    <name>InteractiveStart</name>
  </enumValues>
  <enumValues>
    <name>InteractiveUndoPosting</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeEmbeddedWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeFullscreenWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeKiosk</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeNormal</name>
  </enumValues>
  <enumValues>
    <name>MainWindowModeWorkplace</name>
  </enumValues>
  <enumValues>
    <name>MobileClient</name>
  </enumValues>
  <enumValues>
    <name>Output</name>
  </enumValues>
  <enumValues>
    <name>Posting</name>
  </enumValues>
  <enumValues>
    <name>Read</name>
  </enumValues>
  <enumValues>
    <name>ReadDataHistory</name>
  </enumValues>
  <enumValues>
    <name>ReadDataHistoryOfMissingData</name>
  </enumValues>
  <enumValues>
    <name>SaveUserData</name>
  </enumValues>
  <enumValues>
    <name>SessionOSAuthenticationChange</name>
  </enumValues>
  <enumValues>
    <name>SessionStandardAuthenticationChange</name>
  </enumValues>
  <enumValues>
    <name>Set</name>
  </enumValues>
  <enumValues>
    <name>StandardAuthenticationChange</name>
  </enumValues>
  <enumValues>
    <name>Start</name>
  </enumValues>
  <enumValues>
    <name>SwitchToDataHistoryVersion</name>
  </enumValues>
  <enumValues>
    <name>TechnicalSpecialistMode</name>
  </enumValues>
  <enumValues>
    <name>ThickClient</name>
  </enumValues>
  <enumValues>
    <name>ThinClient</name>
  </enumValues>
  <enumValues>
    <name>TotalsControl</name>
  </enumValues>
  <enumValues>
    <name>UndoPosting</name>
  </enumValues>
  <enumValues>
    <name>Update</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataBaseConfiguration</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistory</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistoryOfMissingData</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistorySettings</name>
  </enumValues>
  <enumValues>
    <name>UpdateDataHistoryVersionComment</name>
  </enumValues>
  <enumValues>
    <name>Use</name>
  </enumValues>
  <enumValues>
    <name>View</name>
  </enumValues>
  <enumValues>
    <name>ViewDataHistory</name>
  </enumValues>
  <enumValues>
    <name>WebClient</name>
  </enumValues>
</mdclass:Enum>

Roles/src/Catalogs/Roles_AccessRoles/ObjectModule.bsl
#Region Private
Procedure OnCopy(CopiedObject)
	For Each Row In Rights Do
		NewID = New UUID;
		FindRestrictions = RestrictionByCondition.FindRows(New Structure("RowID", Row.RowID));
		For Each Restriction In FindRestrictions Do
			Restriction.RowID = NewID;
		EndDo;
		Row.RowID = NewID;
		ConfigRoles = False;
	EndDo;
	
	FindConfigRole = Rights.FindRows(New Structure("ObjectType", Enums.Roles_MetadataTypes.Configuration));
	For Each Row In FindConfigRole Do
		Rights.Delete(Row);
	EndDo;
EndProcedure

Procedure BeforeWrite(Cancel)
	If ConfigRoles And Not AdditionalProperties.Property("Update") Then
		Cancel = True;
	EndIf;
	
	If Not SetSeparateRightToStandardAttributes And Not ConfigRoles Then
		
		FindRowsWithStandardAttribures = Rights.FindRows(New Structure("ObjectSubtype", Enums.Roles_MetadataSubtype.StandardAttribute));
		For Each Row In FindRowsWithStandardAttribures Do
			Rights.Delete(Row);		
		EndDo;
		
		FindFirstLvlType = Rights.FindRows(New Structure("ObjectSubtype, RightName", Enums.Roles_MetadataSubtype.EmptyRef(), Enums.Roles_Rights.View));
		FillStandardAttributes(FindFirstLvlType);
				
		FindFirstLvlType = Rights.FindRows(New Structure("ObjectSubtype, RightName", Enums.Roles_MetadataSubtype.EmptyRef(), Enums.Roles_Rights.Edit));
		FillStandardAttributes(FindFirstLvlType);
	EndIf;
EndProcedure

Procedure FillStandardAttributes(Val FindFirstLvlType)	
	For Each Row In FindFirstLvlType Do
		If Roles_Settings.hasStandardAttributes(Row.ObjectType) Then
			For Each StAttribute In Metadata.FindByFullName(Row.ObjectPath).StandardAttributes Do
				NewRow = Rights.Add();
				FillPropertyValues(NewRow, Row);
				NewRow.ObjectSubtype = Enums.Roles_MetadataSubtype.StandardAttribute;
				NewRow.ObjectPath = NewRow.ObjectPath + ".StandardAttribute." + Roles_SettingsReUse.TranslationList(StAttribute.Name)
			EndDo;
		EndIf;		
	EndDo;
EndProcedure

#EndRegion
